/* Automatic Update Alert Description (Critical Update) */
"%1$@ %2$@ has been downloaded and is ready to use! This is an important update; would you like to install it and relaunch %1$@ now?" = "%1$@ %2$@ telah dimuat turun dan sedia digunakan! Ini ialah kemas kini penting; adakah anda ingin memasangnya dan melancarkan semula %1$@ sekarang?";

/* Automatic Update Alert Description (Normal Update) */
"%1$@ %2$@ has been downloaded and is ready to use! Would you like to install it and relaunch %1$@ now?" = "%1$@ %2$@ telah dimuat turun dan sedia digunakan! Adakah anda ingin memasangnya dan melancarkan semula %1$@ sekarang?";

/* No comment provided by engineer. */
"%1$@ can't be updated when it's running from a read-only volume like a disk image or an optical drive. Move %1$@ to your Applications folder, relaunch it from there, and try again." = "%1$@ tidak dapat mengemas kini apabila ia dijalankan daripada volum baca sahaja seperti imej cakera atau pemacu optik. Pindahkan %1$@ ke folder Aplikasi anda, lancarkannya semula dari situ dan cuba sekali lagi.";

/* No comment provided by engineer. */
"%@ %@ is currently the newest version available." = "%1$@ %2$@ ialah versi terkini yang tersedia sekarang.";

/* No comment provided by engineer. */
"%@ downloaded" = "%@ dimuat turun";

/* No comment provided by engineer. */
"%@ of %@" = "%1$@ daripada %2$@";

/* Description text for SUUpdateAlert when the update is downloadable. */
"A new version of %@ is available. Update to %@ to experience the latest improvements." = "Versi baru %1$@ tersedia. Kemas kini kepada %2$@ untuk mendapatkan peningkatan terkini.";

/* Description text for SUUpdateAlert when the update informational with no download. */
"A new version of %@ is available. Update to %@ to experience the latest improvements. Would you like to learn more about this update on the web?" = "Versi baru %1$@ tersedia. Kemas kini kepada %2$@ untuk mendapatkan peningkatan terkini. Adakah anda ingin mengetahui lebih lanjut tentang kemas kini ini di web?";

/* Automatic Update Alert Title (Normal Update) */
"A new version of %@ is ready to install!" = "Versi baharu %@ sedia untuk dipasang!";

/* No comment provided by engineer. */
"An error occurred in retrieving update information. Please try again later." = "Ralat berlaku semasa mendapatkan semula maklumat kemas kini. Sila cuba lagi kemudian.";

/* No comment provided by engineer. */
"An error occurred while downloading the update. Please try again later." = "Ralat berlaku semasa memuat turun kemas kini. Sila cuba lagi kemudian.";

/* No comment provided by engineer. */
"An error occurred while extracting the archive. Please try again later." = "Ralat berlaku semasa mengekstrak arkib. Sila cuba lagi kemudian.";

/* No comment provided by engineer. */
"An error occurred while installing the update. Please try again later." = "Ralat berlaku semasa memasang kemas kini. Sila cuba lagi kemudian.";

/* No comment provided by engineer. */
"An error occurred while parsing the update feed." = "Ralat berlaku semasa menguraikan suapan kemas kini.";

/* No comment provided by engineer. */
"An error occurred while relaunching %1$@, but the new version will be available next time you run %1$@." = "Ralat telah berlaku semasa melancarkan semula %1$@, namun versi baharu akan tersedia pada kali seterusnya anda menjalankan %1$@.";

/* Automatic Update Alert Title (Critical Update) */
"An important update to %@ is ready to install" = "Kemas kini penting kepada %@ sedia untuk dipasang";

/* the unit for bytes */
"B" = "B";

/* No comment provided by engineer. */
"Cancel" = "Batal";

/* No comment provided by engineer. */
"Cancel Update" = "Batalkan Kemas Kini";

/* No comment provided by engineer. */
"Checking for updates..." = "Menyemak untuk kemas kini...";

/* Take care not to overflow the status window. */
"Downloading update..." = "Memuat turun kemas kini...";

/* Take care not to overflow the status window. */
"Extracting update..." = "Mengekstrak kemas kini...";

/* the unit for gigabytes */
"GB" = "GB";

/* No comment provided by engineer. */
"Install and Relaunch" = "Pasang dan Lancarkan Semula";

/* Take care not to overflow the status window. */
"Installing update..." = "Memasang kemas kini...";

/* the unit for kilobytes */
"KB" = "KB";

/* Alternate title for 'Install Update' button when there's no download in RSS feed. */
"Learn More..." = "Ketahui Lebih Lanjut...";

/* No comment provided by engineer. */
"Let's update your app" = "Mari kemas kini apl anda";

/* the unit for megabytes */
"MB" = "MB";

/* No comment provided by engineer. */
"OK" = "OK";

/* No comment provided by engineer. */
"Ready to Install" = "Sedia untuk Dipasang";

/* No comment provided by engineer. */
"Should %1$@ automatically check for updates? You can always check for updates manually from the %1$@ menu." = "Perlukah %1$@ menyemak kemas kini secara automatik? Anda boleh menyemak kemas kini secara manual daripada menu %1$@ pada bila-bila masa.";

/* No comment provided by engineer. */
"The update is improperly signed." = "Kemas kini ditandatangani dengan betul.";

/* No comment provided by engineer. */
"The update will not be installed because the user requested for the system to power off" = "Kemas kini tidak akan dipasang kerana pengguna meminta supaya sistem dimatikan";

/* Automatic Update Alert Title (Forced Update) */
"Uh oh. Your version of %@ is out of date." = "Alamak. Versi %@ anda sudah lapuk.";

/* No comment provided by engineer. */
"Update Error!" = "Ralat Kemas Kini!";

/* No comment provided by engineer. */
"Updating %@" = "Mengemas kini %@";

/* 'Error' message when the user checks for updates but is already current or the feed doesn't contain any updates. (not necessarily shown in UI) */
"You already have the newest version of %@." = "Anda telah mempunyai versi terbaru %@.";

/* Status message shown when the user checks for updates but is already current or the feed doesn't contain any updates. */
"You're up-to-date!" = "Anda dikemas kini!";

/* Automatic Update Alert Description (Forced Update) */
"You’re currently on version %@ which is no longer supported. We’ve made a lot of improvements since then so please download the latest version to continue." = "Anda kini menggunakan versi %@ yang tidak disokong lagi. Kami telah membuat banyak peningkatan sejak versi tersebut, jadi sila muat turun versi terkini untuk meneruskan.";
